# Brewfile - managed by chezmoi
# Usage: brew bundle --file=Brewfile

# ====================
# Taps
# ====================
tap "daipeihust/tap"
tap "heroku/brew"
tap "xwmx/taps"

# ====================
# Editor / IDE
# ====================
brew "neovim"
brew "neovim-remote"
brew "stylua"

# ====================
# Shell / Terminal
# ====================
brew "tmux"
brew "zsh-autosuggestions"
brew "thefuck"
brew "daipeihust/tap/im-select"

# ====================
# Git
# ====================
brew "git"
brew "gh"
brew "lazygit"
brew "tig"
brew "chezmoi"

# ====================
# Modern CLI Tools
# ====================
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "ghq"
brew "glow"
brew "ripgrep"
brew "zoxide"

# ====================
# Development Languages / Runtimes
# ====================
brew "go"
brew "go-task"
brew "mise"
brew "node"
brew "php"
brew "python@3.12"
brew "uv"

# ====================
# Network / Utilities
# ====================
brew "curl"
brew "nmap"
brew "w3m"
brew "pandoc"
brew "nb"
brew "pygments"

# ====================
# Cask (GUI Apps)
# ====================
cask "claude-code"
cask "ghostty"

# ====================
# Fonts
# ====================
cask "font-hack-nerd-font"
