# Brewfile - Nix未対応/macOS専用パッケージのみ
# CLIツールはNix Home Manager (home.nix) で管理
# Usage: brew bundle --file=Brewfile

# ====================
# Taps
# ====================
tap "daipeihust/tap"
tap "xwmx/taps"

# ====================
# macOS専用 / Nix未対応
# ====================
brew "zsh-autosuggestions"
brew "thefuck"
brew "daipeihust/tap/im-select"
brew "nb"
brew "mise"
brew "git"
brew "node"
brew "php"
brew "python@3.12"
brew "uv"
brew "w3m"
brew "pygments"

# ====================
# Cask (GUI Apps)
# ====================
cask "cmux"
cask "ghostty"

# ====================
# Fonts
# ====================
cask "font-hack-nerd-font"
